{
  "jobs": [
    {
      "experienceType": "software",
      "position": "Software Engineer",
      "company": "Boeing- St Louis, MO",
      "description": "• Built an application to assess the validity of employee timesheet entries.  A SQL database function checked against translation tables maintained in collaboration with the business operations team.  Data output was displayed using d3 for data visualization to help understand labor costs. \\n\\r • Learned and fully implemented advanced features of the Vue framework for a variety of data analytics applications and reconstructing legacy Angular products to help transition an aging library of corporate applications. \\n\\r • Parts and labor tracking system to integrate the builds across teams and systems, enabling wider-reaching analytics. \\n\\r • Centralized data visualization dashboard with responsive layout and reusable data viz components.  Charts and tables that are dynamically populated to avoid repetitive hard-coding and save on future similar requests from customers. Wrapper for tableau api to better integrate server and dashboard functionality across apps. \\n\\r • Ensured data integrity of daily loading from source systems mostly using c#/dotnet and sql scripts with python and R developing new ETL architecture for reusable data analytics pipeline. \\n\\r • Team devops lead - deployment of products using Cloud Foundry, Gitlab CI/CD, bash and powershell scripting, and windows server virtual machine.",
      "startDate": "2019",
      "endDate": "2020 (April)",
      "comments": "reduce task description"
    },
    {
      "experienceType": "software",
      "position": "Developer",
      "company": "Software Project",
      "description": "•  Web App and Social Integration Dashboard \\n\\r •  c#, node.js, vuejs, Auth0, Gapi, REST APIs \\n\\r •  Authentication to Google API (gmail, sheets, drive, etc), LinkedIn, Facebook and access to account's data and programattic access to APIs. User jwt for authentication.  Use cases include mass unsubscribe, sending emails that are programatically created, integrating Linkedin searches with gmail messages for job search, and many others.  Intricacies of authentication through the use of Auth0 and Google as identity providers. \\n\\r •  Future... More integrations and built-in functionality.  Using headless browser to unsubscribe from senders that don't provide a 'mailto' but rather a url.\n",
      "startDate": "",
      "endDate": "",
      "comments": "remove start and end dates"
    },
    {
      "experienceType": "software",
      "position": "Developer",
      "company": "Software Project",
      "description": "•  Poet University \\n\\r •  c#, vuejs, IdentityServer \\n\\r •  An extension of Contoso University in microsoft docs. Has a working implementation of an IdentityServer auth provider.  Frontend client app uses IdentityServer as well as Auth0 to provide authentication for authorization experiments on the protected routes of the University. \\n\\r •  Future... More variety with the faker library.  Better auth.  Cleaner UI. Complete the university environment.",
      "startDate": "",
      "endDate": "",
      "comments": "remove start and end dates"
    },
    {
      "experienceType": "language",
      "position": "Translator / Interpreter",
      "company": "Interpretation Agencies (many)",
      "description": "Medical, dental and media conferences, on-site medical and legal interpretation for depositions, insurance and immigration interviews, simultaneous interpretation of contract negotiations, guided tours, consecutive and simultaneous interpretation for training meetings, document translation of many types, including legal, medical, media localization, and various other language-related assignments, primarily in Spanish, Tagalog and French.",
      "startDate": "2011",
      "endDate": "Present",
      "comments": "change company to more clearly reflect many"
    },
    {
      "experienceType": "language",
      "position": "QA Tester",
      "company": "GTL Media- Los Angeles, CA",
      "description": "Translator, linguistic tester, translated texts for various media including video games, film, and legal, checked video games for linguistic bugs and translation errors, translation of .xml databases for in-game script",
      "startDate": "2011",
      "endDate": "2014"
    },
    {
      "experienceType": "language",
      "position": "Executive Assistant to the CEO",
      "company": "EZI- Manila, Philippines",
      "description": "Managed daily operations in a bilingual office setting, purchased investment property, created investment portfolios, marketing and business plans.",
      "startDate": "2009",
      "endDate": "2010",
      "comments": "simplify description"
    },
    {
      "experienceType": "language",
      "position": "Sinologist (China expert)",
      "company": "World Eye Reports- Shanghai, China",
      "description": "Translator, interpreter, media sales, wrote articles and for advertorial project",
      "startDate": "2003",
      "endDate": "2004",
      "comments": "explain Sinologist; fix dates"
    },
    {
      "experienceType": "hospitality",
      "position": "Grill Chef de Partie",
      "company": "Many, including Post Haus Restaurant - St. Moritz, Switzerland",
      "description": "Expert chef and translator at world-class restaurants",
      "startDate": "2002",
      "endDate": "2018",
      "comments": "simplify and fix dates"
    }
  ]
}