{
  "title": "Carlos Resume 2020 04 23",
  "name": "CARLOS",
  "surname": "SORIANO",
  "address": "Currently in St. Louis, MO",
  "email": "soriano.carlitos@gmail.com",
  "visas": "USA, EU, UK",
  "flags": "🇪🇸, 🇵🇭, 🇺🇸, 🇨🇳, 🇫🇷, 🇮🇹, 🇩🇪, 🇧🇷",
  "brief": "As a lifelong polyglot turned software developer, I have come to describe myself as a Language Data Specialist. A fascination with where human interaction, behaviour and spoken language meets the many layers of data and programming has driven me to provide insight from data sources as they reflect human behavior. \\n\\r In this sense, my route into programming was atypical. The call to bridge the gap between my linguistic expertise and (long-dormant) digital dexterity came in the form of my brother’s coaching, freecodecamp, and finally formal training at Washington University St. Louis Data Analytics Boot Camp. \\n\\r Today, my advanced tech skills combined with my fluency for the most widely spoken languages, allows my clients a unique perspective on their field of choice.",
  "aboutMe": "As a lifelong polyglot and software developer, I have come to describe myself as a Language Data Specialist. \\n\\r Through living, studying and working internationally, I developed keen and varied insight into human interaction, motivation, and the sheer nitty-gritty of life - witnessed everywhere from hospitals to courthouses and union halls in between. \\n\\r Over time, considering where spoken languages and behavior intersect with data got me interested in programming. The call to bridge the gap between my linguistic expertise and (long-dormant) digital dexterity came in the form of my brother’s coaching, freecodecamp, and finally formal training at Washington University St. Louis Data Analytics Boot Camp. \\n\\r Today, I apply my advanced tech skills to analyses that consider where the cultural and the computational collide. This, combined with my fluency for the most widely spoken languages, allows my clients a unique perspective on their field of choice. \\n\\r Showcasing the evolution of these skills in this - <em>work-in-progress</em> - resume site has been a learning process of its own. This site is hosted on <a href=\"https://shortpoet.azurewebsites.net\">Azure</a> with a linked database to dynamically populate different resume formats. Please check out the <a href=\"/pdf\">PDF-friendly</a> version. And coming soon, a guestbook that will fully illustrate the capabilities of a linked data source! 🤓",
  "interests": "When I'm not knuckle-deep in code, I like to knead bread, dig gardens, vermicompost and cook tasty meals.   I do some yoga and pilates to work on the code-bod.   I have been known to be insipired by the dramatic muses.  Ask for an accent sometime! Being a big fan of perspective, when I started going underwater at age 11, what once was a world of fear turned into a world of wonder.  When I can, SCUBA is pretty sweet stuff.  Speaking of perspective, here's some shortpoetry...\n"
}